cell_mapping = {
    "喜界町": {"観光": cell-01-01, "グルメ":cell-01-02, "特産品":cell-01-03, "郷土芸能":cell-01-04, "歴史文化":cell-01-05, "体験": cell-01-06, "経路":cell-01-07},
"龍郷町": {"観光": cell-02-01, "グルメ":cell-02-02, "特産品":cell-02-03, "郷土芸能":cell-02-04, "歴史文化":cell-02-05, "体験": cell-02-06, "経路":cell-02-07},
"奄美市": {"観光": cell-03-01, "グルメ":cel3-01-02, "特産品":cell-03-03, "郷土芸能":cell-03-04, "歴史文化":cell-03-05, "体験": cell-03-06, "経路":cell-03-07},
"大和村": {"観光": cell-04-01, "グルメ":cell-04-02, "特産品":cell-04-03, "郷土芸能":cell-04-04, "歴史文化":cell-04-05, "体験": cell-04-06, "経路":cell-04-07},
"宇検村": {"観光": cell-05-01, "グルメ":cell-05-02, "特産品":cell-05-03, "郷土芸能":cell-05-04, "歴史文化":cell-05-05, "体験": cell-05-06, "経路":cell-05-07},
"瀬戸内町": {"観光": cell-06-01, "グルメ":cell-06-02, "特産品":cell-06-03, "郷土芸能":cell-06-04, "歴史文化":cell-06-05, "体験": cell-06-06, "経路":cell-06-07},
"徳之島町": {"観光": cell-07-01, "グルメ":cell-07-02, "特産品":cell-07-03, "郷土芸能":cell-07-04, "歴史文化":cell-07-05, "体験": cell-07-06, "経路":cell-07-07},
"天城町": {"観光": cell-08-01, "グルメ":cell-08-02, "特産品":cell-08-03, "郷土芸能":cell-08-04, "歴史文化":cell-08-05, "体験": cell-08-06, "経路":cell-08-07},

 "伊仙町": {"観光": cell-09-01, "グルメ":cell-09-02, "特産品":cell-09-03, "郷土芸能":cell-09-04, "歴史文化":cell-09-05, "体験": cell-09-06, "経路":cell-09-07},
"知名町": {"観光": cell-10-01, "グルメ":cell-10-02, "特産品":cell-10-03, "郷土芸能":cell-10-04, "歴史文化":cell-10-05, "体験": cell-10-06, "経路":cell-10-07},
 "和泊町": {"観光": cell-11-01, "グルメ":cell-11-02, "特産品":cell-11-03, "郷土芸能":cell-11-04, "歴史文化":cell-11-05, "体験": cell-11-06, "経路":cell-01-07},
 "与論町": {"観光": cell-12-01, "グルメ":cell-12-02, "特産品":cell-12-03, "郷土芸能":cell-12-04, "歴史文化":cell-12-05, "体験": cell-12-06, "経路":cell-12-07}

    # 他の市町村も追加
}